fwolfst/ESP8266-APSystems/src/ESP-ECU-v10_8.cpp

//#include <lwip/tcp_impl.h>
#include <AsyncEventSource.h>
#include <AsyncJson.h>
#include <AsyncWebSocket.h>
#include <AsyncWebSynchronization.h>
#include <ESPAsyncWebServer.h> // __cleanup__: was ESPAsyncWebSrv.h (from dvarrel fork)
#include <SPIFFSEditor.h>
#include <StringArray.h>
#include <WebAuthentication.h>
#include <WebHandlerImpl.h>
#include <WebResponseImpl.h>

/*  edit readZigbee
 *  made processIncomingByte redundant
 *  moved crc and slen to sendZigbee
 *  added a debugmessage to sendzigbee when (diag)
 *  removed the line 336 memset crashed the zigbee
 *  remove intopic and changed that to clientid
 *  introduced a processor to bring the invertercount to the frontpage
 *  and the polling start/end time
 *  no more need for get.Times.
 *  Splitted up get.Power in a get.General that only loads remote, state and night
 *  the power and energy values are provided by get.Power
 *  introduced arduinojson to make the jsons send to the webpages
 *  disabled the menu links, log is made but cannot be visited.
 *  the call to get.Inverter does not eat memory
 *  if i have the frontpage open not eat memory >28000 start with 29760
 *  opening the detailspage lowers the memory so we separated the script to make the page smaller
 *  still memory lowering but over 28.500 after one hour
 *  seen a memory dip without knowing what happened. Perhaps sending a page while polling? 
 *  Can we block the webserver while polling? Or the other way around?
 *  I intoduced memCheck, only poll when enough mem defau;t 20000
 *  removed the memcheck, stripped off the favicon and the help
 *  changed mqttconfig not using string toSend
 *  to minimize the wifi trafic and to preven collision betweeen cpu hungry polling and webserver
 *  sending large pages, we trigger a page reload and get.data by the software
 *  get.Data after polling or reset values
 *  reload when status has changed eg after boot , sleep wake and when a zigbee start attempt
 *  changed the static jsons in the http requests and remomved the use of jsonObject
 *  load the homepage without the scripts, see if this eats memory
 *  combined the page and java files and removed all wjitepace to make them smaller
 *  heap goes down with 96 every visit of the webpage infopage
 */
#define VERSION  "ESP-ECU_v10_8"

#include <TimeLib.h>
#include <time.h>
#include <sunMoon.h>

#include <LittleFS.h>
#include <DNSServer.h>            //Local DNS Server used for redirecting all requests to the configuration portal
#include <EEPROM.h>
#include <ArduinoJson.h>
//#include "AsyncJson.h"
#include <Arduino.h>

#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>

//#include "ESPAsyncWebServer.h"
AsyncWebServer server(80); //
AsyncEventSource events("/events"); 
AsyncWebSocket ws("/ws");

#include <PubSubClient.h>

#include <NTPClient.h>
#include <WiFiUdp.h>
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org");
//const byte DNS_PORT = 53;
DNSServer dnsServer;

#define LOG

#include "ESP-ECU.h"

#include "HTML.h"
//#include "AAA_CONFIG_INVERTERS.H"
#include "AAA_MENUPAGE.h"
#include "AAA_HOMEPAGE.h"
#include "PORTAL_HTML.h"
#include "DETAILSPAGE.h"
#include "TEST.h"
//#include "ABOUT2.H"
//#include "DIV_HTML.H"

#include "SPIFFS_RW.cpp"
#include "Start_WiFi.cpp"
#include "TIJD_GET.cpp"
#include "LOGPAGE.cpp"
#include "AA_CONSOLE.cpp"
#include "AAA_DECODE.cpp"
#include "MQTT.cpp"
#include "ISR.cpp"
#include "ZIGBEE_HEALTH.cpp"
#include "ZIGBEE_HELPERS.cpp"
#include "ZIGBEE_PAIR.cpp"
#include "ZIGBEE_COORDINATOR.cpp"
#include "ZIGBEE_POLLING.cpp"
#include "test.cpp"

/*
 * if we define TEST we have a special environment to test the decoding of a string
 * for the different invertertypes. We only test inv0. If we set this up as a DS3
 * a ds3 string will be analyzed.
 * - no automatic polling
 * - no automatic healthcheck
 * - no start of zigbee at boot\
 * - in the console an option to test inv 0 '10;TESTINV'
 * - more debug information in the console
 * upgraded from 2.7.1
 */
//#define MEMCHECK // when defined we mqtt memory every 1 minute
//#define TEST
#ifdef TEST
int testCounter = 0;
#endif

////#define DEBUG
#ifdef  DEBUG
#define DebugPrint(x)     Serial.print (x)
#define DebugPrintDec(x)  Serial.print (x, DEC)
#define DebugPrintln(x)   Serial.println (x)
#else
#define DebugPrint(x)
#define DebugPrintDec(x)
#define DebugPrintln(x)
#endif

//float calliBration = 1.66;
  //bool stoPPed = false;
  bool USB_serial = true;
  char ssid[33] = ""; // was 33 
  char pass[64] = ""; // was 40
  bool tryConnectFlag = false;
// variables concerning time and timers
  WiFiUDP Udp; 
  //time_t daybeginTime = 0;
  time_t switchoffTime = 0;
  time_t switchonTime = 0;
  bool dayTime=true;
  uint8_t actionFlag = 0;

 // variables wificonfig
  char pswd[11] = "0000";
  char userPwd[11] = "1111";  
  float longi = 5.123;
  float lati = 51.123;
  char gmtOffset[5] = "+120";  //+5.30 GMT
  bool zomerTijd = true;
  char static_ip[16] = "000.000.000.000";
  int securityLevel = 0;


// ***************************************************************************
//                             variables ECU
// ***************************************************************************
// ZIGBEE_globals

//char inMessage[CC2530_MAX_SERIAL_BUFFER_SIZE] = {0};
int readCounter = 0;

bool diagNose=true; // we startup with all debug info
bool Polling = true; // when true we have automatic polling
int errorCode=10;


  int t_saved[MAX_NUMBER_OF_INVERTERS] = {0};
  float en_saved[MAX_NUMBER_OF_INVERTERS][4] = {0}; 
  //to remember the value of the previous poll. 
  //This value is the energy that is reported by the inverter
  
  char txBuffer[50];


inverters Inv_Prop[MAX_NUMBER_OF_INVERTERS]; 

inverterdata Inv_Data[9];

  uint8_t zigbeeUp = 11; // initial allways initializing, this changes to 1 = up or 0 not up after initial healthcheck
 
 char ECU_ID[13] = "D8A3011B9780";

