fwolfst/ESP8266-APSystems/src/ESP-ECU-v10_8.cpp
char requestUrl[12] = {""}; // to remember from which webpage we came  

// variables mqtt ********************************************
  char  Mqtt_Broker[30]=    {"192.168.0.100"};
//  char  Mqtt_inTopic[16] =  {"ESP-ECU/in"};
  char  Mqtt_outTopic[26] = {"domoticz/in"}; // was 26
  char  Mqtt_Username[26] = {""};
  char  Mqtt_Password[26] = {""};
  char  Mqtt_Clientid[26] = {""};
  char  Mqtt_Port[5] =  {"1883"};
  int   Mqtt_Format = 0;

  //long    mqtt_lastConnect = 0;

  int event = 0;

  int dst;
  int iKeuze;
  int inverterTopoll = 0;
  bool timeRetrieved = false;
  int networksFound = 0; // used in the portal
  int datum = 0; //

  unsigned long previousMillis = 0;        // will store last temp was read
  unsigned long laatsteMeting = 0; //wordt ook bij OTA gebruikt en bij wifiportal // __cleanup__ was static
  static unsigned long lastCheck = 0; //wordt ook bij OTA gebruikt en bij wifiportal
#ifdef MEMCHECK
  static unsigned long lastmemCheck = 0; //memory check
#endif  

String toSend = "";
 
int value = 0; 
int aantal = 0;
int resetCounter=0;


int domIdx = 0; // __cleanup__: No idea where this was defined otherwise

// *******************************  log *************************************
//// variables To record and display last events on the home page.
#ifdef LOG

logEvent Log_EventList[Log_MaxEvents]; // __cleanup__ from LogEventList
bool Log_MaxReached = false;
byte logNr = 0;
byte Log_CurrentEvent; // __cleanup__ probably the same as logNr
#endif


WiFiClient espClient ;
PubSubClient MQTT_Client(espClient) ;

int Mqtt_stateIDX = 0;
int pollOffset = 0;
int inverterKeuze=0;
int inverterCount=0;
bool polled[9]; //={false,false,false,false,false,false,false,false,false};
//int checkTeller = 0;

//unsigned int memCheck = 20000;
//int lowmemCounter = 0;

bool getallTrigger = false;
bool reloadTrigger = false;

// Forward decl
void read_eeprom();
void poll_all();
void eventSend(byte what);
void test_actionFlag();
void eraseWifiFlash();
void showDir();

// *****************************************************************************
// *                              SETUP
// *****************************************************************************


void setup() {
  Serial.begin(115200);

//    // init record of stack
//    char stack;
//    stack_start = &stack;

  
  pinMode(knop, INPUT_PULLUP); // de knop
  pinMode(led_onb, OUTPUT); // onboard led
  pinMode(ZB_TX, OUTPUT);
  digitalWrite(ZB_TX, LOW); //
  pinMode(ZB_RESET, OUTPUT);// resetpin cc2530 
  digitalWrite(ZB_RESET, HIGH);
  pinMode(4, OUTPUT); // 
  digitalWrite(4, LOW); //
  
  ledblink(1, 800);

#ifdef USE_ISR_KNOB
   attachInterrupt(digitalPinToInterrupt(knop), isr, FALLING);
#endif

  SPIFFS_read();
 // now we know the number of inverters we can find an interval between pollings
 //int pollintervall = 300/inverterCount;  
// takes care for the return to the last webpage after reboot
  read_eeprom(); // put the value of requestUrl back
  if (requestUrl[0] != '/' ) strcpy(requestUrl, "/");  // vangnet
  Serial.println("\n\nrequestUrl = " + String(requestUrl));
  
  start_wifi(); // start wifi and server

// reed inverter files
  for (int x=0; x < inverterCount+1; x++) 
  {
  String bestand = "/Inv_Prop" + String(x) + ".str";  
  //DebugPrint("reading file "); //DebugPrintln(bestand);
      if (!leesStruct(bestand)) 
      { 
        // if the file not exists we break
        break;
      }
  }
  #ifdef DEBUG
  //printInverters(); // show the inverter files
  #endif
  //test_polling(0);
  getTijd(); // retrieve time from the timeserver
  #ifdef LOG 
  Update_Log(1, "boot up"); 
  #endif

//  // ****************** mqtt init *********************
       MQTT_Client.setKeepAlive(150);
       MQTT_Client.setBufferSize(512);
       MQTT_Client.setServer(Mqtt_Broker, atoi(Mqtt_Port) );
       MQTT_Client.setCallback ( MQTT_Receive_Callback ) ;

  if ( Mqtt_Format != 0 ) 
  {
       Serial.println(F("setup: mqtt configure"));
       mqttConnect(); // mqtt connect
  } 
  else 
  {
#ifdef LOG
   Update_Log(3, "not enabled"); 
#endif 
  }
  initWebSocket();
//       Serial.println("logNr=" + String(logNr));   
  //DebugPrintln("ATTENTION DEBUG DEFINED");
  Serial.println(F("booted up, checking coordinator"));
  Serial.println(WiFi.localIP());
  int hp_len = sizeof(ECU_HOMEPAGE)/sizeof(ECU_HOMEPAGE[0]);
  Serial.println("ECU_HOMEPAGE length = " + String(hp_len) );
  hp_len = sizeof(STYLESHEET_HOME)/sizeof(STYLESHEET_HOME[0]);
  Serial.println("stylesheet_home length = " + String(hp_len) );  
  hp_len = sizeof(STYLESHEET_SUBS)/sizeof(STYLESHEET_SUBS[0]);
  Serial.println("stylesheet_subs length = " + String(hp_len) );   
  hp_len = sizeof(MENUPAGE)/sizeof(MENUPAGE[0]);
  Serial.println("MENUPAGE length = " + String(hp_len));  
  hp_len = sizeof(HTML_HEAD)/sizeof(HTML_HEAD[0]);
  Serial.println("HTML_HEAD length = " + String(hp_len));
  hp_len = sizeof(LOGPAGE)/sizeof(LOGPAGE[0]);
  Serial.println("LOGPAGE length = " + String(hp_len));
  hp_len = sizeof(DETAILSPAGE)/sizeof(DETAILSPAGE[0]);
  Serial.println("DETAILSPAGE length = " + String(hp_len));
//  hp_len = sizeof(DETAILS_SCRIPT)/sizeof(DETAILS_SCRIPT[0]);
//  Serial.println("DETAILS_SCRIPT length = " + String(hp_len));
//  hp_len = sizeof(JAVA_SCRIPT)/sizeof(JAVA_SCRIPT[0]);
//  Serial.println("JAVA_SCRIPT length = " + String(hp_len)); 
    
  
  
  #ifndef DEBUG 
  Serial.println(F("swapping serial to zb, goodbye"));
  swap_to_zb(); // permanent zigbee serial 
  #endif
  delay(1000);
  ledblink(3,500);
  #ifndef TEST
  #ifdef LOG 
  Update_Log(2,"healthcheck"); 
  #endif
  healthCheck(); // check the state of the zigbee system and if oke then poll the inverters
  if(zigbeeUp == 1) {
        #ifdef LOG 
        Update_Log(2,"running"); 
        #endif
          // we poll our inverters immediatly
          if(Polling)
          {
            poll_all();
          }
     }
  #endif
  resetCounter = 0;
//  stoPPed = false;

#ifdef TEST
t_saved[0] = 36587;
zigbeeUp = 1;
//force_values(); // now we have values for all inverters
#endif 
//reloadTrigger = true; // we reload the frontpage to reflect the status
//events.send( "reload", "message");
eventSend(0);
} // end setup()

//****************************************************************************
//*                         LOOP
//*****************************************************************************
void loop() {

