fwolfst/ESP8266-APSystems/src/ESP-ECU-v10_8.cpp
// ***************************************************************************
//                       day or night mode
// ***************************************************************************
#ifdef TEST
// always daytime to be able to test
 dayTime = true;
#endif
// when no time is retrieved, swOn an swOff times are null
// so this eveluate to false, so always nightmode 
   if(now() > switchonTime && now() < switchoffTime) 
    {
          if(!dayTime)  
          {
             dayTime = true;
             //String term= "wake-up from nightmode";
             #ifdef LOG 
             Update_Log(1, "woke-up"); 
             #endif
             if(diagNose) ws.textAll(F("wake-up from nightmode"));
             // reset the dayly energy at wakeup and send mqtt message
             resetValues(true, true);
             //events.send( "reload", "message"); // refresh the data and state
             eventSend(0);
            }
    } else {
         if(dayTime) 
         {
            dayTime = false;
            //String term= "start nightmode";
            #ifdef LOG 
            Update_Log(1, "nightmode"); 
            #endif
            if(diagNose) ws.textAll(F("start nightmode"));
            // we send null messages for each inverter
            resetValues(false, true); // make all values zero exept energy and send mqtt
            //events.send( "general", "message"); // refresh the data and state
            eventSend(1);
            actionFlag = 250; // triggers the reset values and mqtt null message at midnight
         }
    }

//              polling every 300 seconds 
// ******************************************************************

  unsigned long nu = millis();  // the time the program is running
//   if (nu - laatsteMeting >= 1000UL * (300 / inverterCount)) 
   if (nu - laatsteMeting >= 1000UL * 300) 
   {
     if(diagNose) ws.textAll( "300 secs passed" ); //
     laatsteMeting += 1000UL * 300 ; // increases each time with (300/inverterCount * miliseconds);
       if(dayTime && Polling && zigbeeUp == 1) // we only poll at day and when Polling = true 
          { 
             ledblink(1,100);
             poll_all(); //if inverterCount = 9 than we have inverters 0-8
          } 
 }
// ******************************************************************
//     healthcheck every 10 minutes but 2 minutes later than poll 
// ******************************************************************
//   nu = millis() + 1000UL * 120 ; // 120 sec = 12 minutes later
   if (nu - lastCheck >= 1000UL * 600) // was 600
   {
         //ws.textAll("600 secs passed" + String(millis()) );
         lastCheck += 1000UL * 600;
         healthCheck(); // checks zb radio, mqtt and time, when false only message if error
   }

// ******************************************************************
//     memory check every minute  
// ******************************************************************
#ifdef MEMCHECK
   if (nu - lastmemCheck >= 1000UL * 60) // was 600
   {
         
         lastmemCheck += 1000UL * 60;
         
         memoryCheck(); // checks free heap
   }
#endif
  // we recalculate the switchtimes for this day when there is a new date
  // if retrieve fails, day will not be datum, so we keep trying
  if (day() != datum && hour() > 2) // if date overflew and later then 2
  { 
          //check if the heap is large enough, else reset
          if (ESP.getFreeHeap() < 16000) ESP.restart();
          getTijd(); // retrieve time and recalculate the switch times
          //delay(500);
          //ESP.restart();
  }
 
  // we do this before sending polling info and healthcheck
  // this way it can't block the loop
  if(Mqtt_Format != 0 ) MQTT_Client.loop(); //looks for incoming messages
 
  //*********************************************************************
  //             send null data at midnight 
  // ********************************************************************
  if(hour() == 0 && timeRetrieved && actionFlag == 250)
  {
      if(second() > 0 ) 
      {
        resetValues(true, true); //set all values to zero and sent mqtt
        #ifdef LOG 
        Update_Log( 1, "values reset"); 
        #endif
        actionFlag = 0; // to prevent repetition
        //events.send( "getall", "message");
        eventSend(2);
        // ZBhardReset(); // reset the zigbeemodule
        // healthCheck(); // this increases the resetcounter so we decrease it
        // resetCounter--; // so that this reset is not counted
       }
  }
  
  test_actionFlag();
  
  if( Serial.available() ) {
    empty_serial(); // clear unexpected incoming data
   }

   ws.cleanupClients();
   yield(); // to avoid wdt resets

}
//****************  End Loop   *****************************

// flash the led
void ledblink(int i, int wacht) {
  for(int x=0; x<i; x++) {
    digitalWrite(led_onb, LED_AAN);
    delay(wacht);
    digitalWrite(led_onb, LED_UIT);
    delay(wacht);
   }
}



void empty_serial() { // remove any remaining data in serial buffer
  while(Serial.available()) {
    Serial.read();
  }
}

// ****************************************************************
//                  eeprom handlers
//*****************************************************************
void write_eeprom() {
    EEPROM.begin(24);
  //struct data
  struct { 
    char str[16] = "";
    int haha = 0;
  } data;

 strcpy( data.str, requestUrl ); 
 data.haha = iKeuze;
    EEPROM.put(0, data);
    EEPROM.commit();
}
void read_eeprom() {
    EEPROM.begin(24);

  struct { 
    char str[16] = "";
    int haha = 0;
  } data;

  EEPROM.get(0, data);
  //Serial.println("read value from  is " + String(data.str));
  strcpy(requestUrl, data.str);
  iKeuze = data.haha; // inverterkeuze
  EEPROM.commit();
}

// all actions called by the webinterface should run outside the async webserver environment
// otherwise crashes will occure.
    void test_actionFlag() {
  // ******************  reset the nework data and reboot in AP *************************
    if (actionFlag == 11 || value == 11) { // 
     //DebugPrintln("erasing the wifi credentials, value = " + String(value) + "  actionFlag = " + String(actionFlag));
     delay(1000); //reserve time to release the button
     eraseWifiFlash();
     WiFi.disconnect(true);
     //Serial.println(F("wifi disconnected"));
     ESP.restart();
  }  

    if (actionFlag == 10) { // reboot
     delay(2000); // give the server the time to send the confirm
     //DebugPrintln("rebooting");
     write_eeprom();
     ESP.restart();
  }
    if (actionFlag == 60) {
      actionFlag = 0; //reset the actionflag
      pairOnActionflag();
    }
    if (actionFlag == 21) {
      actionFlag = 0; //reset the actionflag
      coordinator(true); // start normal operation mode
      //events.send( "general", "message"); // update the data
      eventSend(1);
    }
//    if (actionFlag == 22) {
//      actionFlag = 0; //reset the actionflag
//      coordinator(false); // start pairing mode
//    }
#ifdef TEST
    if (actionFlag == 122) {
      actionFlag = 0; //reset the actionflag
      if(testCounter > 1) { 
        testCounter=0; // reset testcounter
        // make all values null
        resetValues(true, false);
      }
      testDecode(); // test a fake polling answer for the invType
    }
//    if (actionFlag == 123) {
//      actionFlag = 0; //reset the actionflag
//      testDecode(); // test a fake pollinganswer for qs
//    }    
#endif
    
    if (actionFlag == 24) {
        actionFlag = 0; //reset the actionflag
        MQTT_Client.disconnect() ;
       //reset the mqttserver
        MQTT_Client.setServer ( Mqtt_Broker, atoi(Mqtt_Port) );
        MQTT_Client.setCallback ( MQTT_Receive_Callback ) ;
        if (Mqtt_Format != 0) mqttConnect(); // reconnect mqtt after change of settings
    }    
    if (actionFlag == 25) {
      actionFlag = 0; //reset the actionflag
      getTijd(); // recalculate time after change of settings
    }
    if (actionFlag == 44) { //triggered by the webpage zbtest
        actionFlag = 0; //reset the actionflag
        healthCheck(); 
    }
    if (actionFlag == 45) { //triggered by the webpage zbtest
        actionFlag = 0; //reset the actionflag
        testMessage();
    }
    if (actionFlag == 46) { //triggered by the webpage zbtest
        actionFlag = 0; //reset the actionflag
        showDir(); 
    }
    
